12
SPOTLIGHT-FIND-TERMINAL

- -символ домашней директории (папки)
/ - символ корневой директории (папки)
.. - обозначают предыдущую директорию
. - обозначает текущую директорию
1. ls(List) - выводит список всех папок(директорий) и файлов в текущей рабочей директории
2. cd(change directory) - меняет текущую директорию (папку) на указанную (cd <название директории>)
3. touch ->создает указанный файл (touch <name_of_file>)
4. Pwd (present working directory) -> выводит путь до текущей директории (папка)
5. Mkdir (make directory) -> создает указанную директории
6. Rmdir (remove directory) -> удаляет указанную директорию 
7. Rm -rf -> принудительное удаление
8. Rm -> удаление файла
9. Ls -a -> выводит список как скрытых таки обычных директорий и файлов
10. Nano <path_to_file> - открывает графический интерфейс для редактирования файла *если нет указанного файла, то создаться новый файл с таким именем
11. Cat <path_to_file> -> выводит содержимое файла
