
#WEEK 3

'''
1. Создайте словарь и выведите один из ключей.
'''
# dict_ = {
#   'number': 1,
#   'name': 'Bill',
#   'color': 'blue'
# }
# print(list(dict_.keys())[1])
'''
2. Создайте словарь с любыми элементами, удалите один из элементов и распечатайте удалённый элемент.
'''
# dict_ = {
#     'rock': 'high',
#     'sky': 'blue',
#     'tree': 'old',
#     'river': 'fast'
# }
# dict_.pop('tree')
# print(dict_)
'''
3. Создайте словарь, добавьте в него новую пару ключ: значение и распечатайте.
'''
# dict1 = {
#   'number': 13,
#   'name': 'John',
#   'color': 'red',
# } 
# print(dict1)
# result = dict1.setdefault('speed','fast')
# print(dict1)
'''
4. Создайте словарь, удалите всего его элементы и распечатайте результат.
'''
# dict2 = {
#   'number': 200,
#   'stone': 'hard',
#   'chocolate': 'sweet'
# }
# print(dict2.clear())
'''
5. Создайте словарь, выведите все его ключи.
'''
# dict3 = {
#   'id': 12,
#   'color': 'yellow',
#   'phone': 'apple',
#   'car': 'cadillac'
# }
# for i in dict3.keys():
#   print(i)
'''
6. Создайте словарь, сделайте его копию и распечатайте её.
'''
# dict4 = {
#   'first_name': 'Bill',
#   'last_name': 'Clinton',
#   'age': 75
# }
# dict5 = dict4.copy()
# print(dict5)
'''
7. Дан словарь, нужно перебрать его и распечатать все ключи.
'''
# dict_ = {
#     'A': 1,
#     'B': 2,
#     'C': 3,
#     'D': 4,
#     'E': 5,
#     'F': 6
# }
# for key in dict_.keys():
#     print(key)
'''
8. Создайте словарь, перебирите его и распечатайте все значения
'''
# dict_x = {
#     'A': 1,
#     'B': 2,
#     'C': 3,
#     'D': 4,
#     'E': 5,
#     'F': 6
# }
# for value in dict_x.values():
#     print(value)
'''
9. Создайте словарь с числовыми значениями, пройдитесь по элементам и замените все чётные числа на число 2.
Пример: Ввод -> a = {'a': 1, 'b': 4, 'c': 1, 'd': 5, 'e': 6}
        Вывод -> a{'a': 1, 'b': 2, 'c': 1, 'd': 5,  'e': 2}
'''
# dict6 = {
#   'a': 1,
#   'b': 4,
#   'c': 1,
#   'd': 5,
#   'e': 6
# }
# for v in dict6.item():
#   if v//2 == 1:
#     print(v)  

'''
10. Дан словарь, удалите из него все элементы с пустыми значениями.
Пример: a = {'a': None, 'b': 1, 'c': 2, 'd': None, 'e': 3} ->
          {'b': 1, 'c': 2, 'e': 3}
'''
# a = {'a': None, 'b': 1, 'c': 2, 'd': None, 'e': 3}
# b = {k: v for k, v in a.items() if v}
# print(b)
'''
11. Создайте словарь, где ключами будут названия товаров, а значениями их цены,  затем, его нужно перебрать циклом и поменяйте все значения элементов, разделив их на 5
'''
# dictx = {
#   'Samsung': 200,
#   'LG': 300,
#   'Sony': 150,
#   'Apple': 400
# }
# dicty = {}
# for key in dictx.keys():
#   f = dictx.get(key)
#   dicty.update({key: f/5})

# print(dicty)  
  
'''
12. Создайте словарь где ключами будут фрукты, а значением их цены. Удалите те элементы, значение которых будет чётным.
'''
# fruits = {
#   'Limon': 1,
#   'orange': 3,
#   'cherry': 2,
#   'Apple': 5,
#   'Peach': 4
# }
# fruits2 = {}
# for key in fruits.keys():
#   f = fruits.get(key)
#   if f%2!=0:
#     fruits2.update({key: f})

# print(fruits2) 
'''
13. Создайте словарь, а затем поменяйте местами ключи и значения. Распечайте полученный результат.
'''
# dict_ = {
#   'a': 1,
#   'b': 2,
#   'c': 3,
#   'd': 4,
#   'f': 5
# }
# print(dict_)
# dict1 = {v:k for k, v in dict_.items()}
# print(dict1)
'''
14. Создайте словарь, где значениями будут являться числа. Найдите сумму этих значений.
'''

# a = {
#   'a': 23,
#   'b': 12,
#   'c': 54,
#   'd': 9,
#   'f': 30
# }
# b = sum(a.values())
# print(b)
'''
15. Создайте словарь тремя возможными способами.
'''
# 1. способ 
# a = {
#   'A': 11,
#   'B': 12,
#   'C': 13,
#   'D': 14,
#   'E': 15
# }
# print(a)
# 2. способ

# b = dict(A=11, B=12, C=13, D=14, E=15)
# print(b)

# 3 способ:

# a = [['A',11],['B',12],['C',13],['D',14],['E',15]]
# c = dict(a)
# print(c)

