
# GIT - распределенная система контроля версий. 
# Это система для отслеживания и ведения истории изменения файлом, в вашем проекте.

# Репозиторий - это хранилище вашего кода и истории его изменений

# GitHub - это веб-сайт для размещения git-репозиториев и совместной разработки проектов.


# Команды Git

# 1. git init - создает новый гит репозиторий локальный на вашем ПК
# 2. git commit - как только мы достигаем определенного момента в разработке, то тогда мы сохраняем 
# и комментируем изменения (фиксация изменений в репо).
# git commit -m '<comment>'

# 3. git add - когда мы создаем или изменяем файлы, то при помощи этой команды мы загружаем все изменения в локальное хранилище
#  git add <название файла>
#  git add .  добавляет все что есть в директории





